//
//  ConfigManager.swift
//  KoeNaWin
//
//  Created by Nanda WK on 2025-03-29.
//

import Foundation

var koeNaWinStages = KoeNaWinStages()

@MainActor
final class ConfigManager: ObservableObject {
    @Published private(set) var hasLoaded = false

    func loadData() {
        koeNaWinStages = Bundle.main.decode(KoeNaWinStages.self, from: "KoeNaWin.json")
        hasLoaded = true
    }
}

let buddhaAttributes: [String: String] = [
    "အရဟံ": "ကိလေသာကို ပယ်သတ်တော် မူပြီးသော မြတ်စွာဘုရား။ ဆိတ်ကွယ်ရာအရပ်တွင်ပင် မကောင်းမှု မပြု။ ပူဇော်မှုအထူး ခံထိုက်တော်မူသော မြတ်စွာဘုရား။",
    "သမ္မာသမ္ဗုဒ္ဓေါ": "တရားအပေါင်းကို ဆရာမရှိ ကိုယ်တော်တိုင် သိတော်မူသော မြတ်စွာဘုရား။",
    "ဝိဇ္ဇာစရဏသမ္ပန္နော": "ဝိဇ္ဇာ ၃ ပါး၊ ဝိဇ္ဇာ ၈ ပါး၊ စရဏ ၁၅ ပါး ပြည့်စုံတော်မူသော မြတ်စွာဘုရား။",
    "သုဂတော": "ကောင်းသော စကားကိုသာ ဆိုတော်မူသော မြတ်စွာဘုရား။",
    "လောကဝိဒူ": "လောက ၃ ပါးကို အကြွင်းမဲ့ သိတော်မူ မြတ်စွာဘုရား။",
    "အနုတ္တရောပုရိသဓမ္မသာရထိ": "ဘုရားရှင်ထက် မြင့်မြတ်သာလွန်သူမရှိ။ လူ နတ် ဗြဟ္မာ တိရိစ္ဆာန် ကြမ်းတို့အား ယဉ်ကျေးအောင် ဆုံးမတော် မူသော မြတ်စွာဘုရား။",
    "သတ္ထာဒေဝမနုဿာနံ": "လူ နတ် ဗြဟ္မာ သတ္တဝါ အပေါင်းတို့၏ ဆရာဖြစ်တော်မူသော မြတ်စွာဘုရား။",
    "ဗုဒ္ဓေါ": "သစ္စာလေးပါး မြတ်တရားကို ကိုယ်တော်တိုင်လဲ သိ၊ ဝေနေယျ သတ္တဝါတွေကိုလည်း သိစေတော်မူသော မြတ်စွာဘုရား။",
    "ဘဂဝါ": "ဘုန်းတော်ခြောက်ပါး နှင့် ပြည့်စုံတော် မူသော မြတ်စွာဘုရား။",
]
